app/controllers/sessions_controller.rb

    def create
        username = params[:username]
        password = params[:password]
        user = User.find_by(username: username)
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "kek111"], ["LIMIT", 1]]