app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)

        if User.exists?(email: @user.email)
            redirect_to '/login', alert: 'Email is already taken.'
        elsif User.exists?(username: @user.username)
            redirect_to '/login', alert: 'Usename is already taken.'
        elsif @user.save
---
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "tyusindima@gmail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "DimLanks"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", ""], ["LIMIT", 1]]
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["username", ""], ["email", ""], ["password", "[FILTERED]"], ["created_at", "2023-12-09 07:44:34.152903"], ["updated_at", "2023-12-09 07:44:34.152903"]]